app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers" ORDER BY "drivers"."id" ASC
---
  def index
    @drivers = Driver.all

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_driver
    @driver = Driver.find(params[:id])