app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers"
---
  def index
    @drivers = Driver.all

INSERT INTO "drivers" ("name", "vin", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Home Dawg"], ["vin", "098"], ["created_at", "2019-10-11 07:32:11.623685"], ["updated_at", "2019-10-11 07:32:11.623685"]]
---
  def create
    @driver = Driver.new(driver_params)

    respond_to do |format|
      if @driver.save

UPDATE "drivers" SET "name" = $1, "vin" = $2, "updated_at" = $3 WHERE "drivers"."id" = $4  [["name", "Not Kari haha"], ["vin", "987"], ["updated_at", "2019-10-11 15:53:49.171717"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @driver.update(driver_params)

DELETE FROM "drivers" WHERE "drivers"."id" = $1  [["id", 101]]
---
  def destroy
    @driver.destroy

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 777], ["LIMIT", 1]]
---
  def set_driver
    @driver = Driver.find(params[:id])