app/controllers/drivers_controller.rb

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    driver_id = params[:id].to_i
    @driver = Driver.find_by(id:params[:id])