app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers" ORDER BY "passengers"."id" ASC
---
  def index
    @passengers = Passenger.all