app/controllers/passengers_controller.rb

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 90], ["LIMIT", 1]]
---
  def show
    passenger_id = params[:id]
    @passenger = Passenger.find_by(id: passenger_id)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", -666], ["LIMIT", 1]]
---
  def edit
    @passenger = Passenger.find_by(id: params[:id])

INSERT INTO "passengers" ("name", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Homer Simpson"], ["phone_num", "425-123-1234"], ["created_at", "2019-10-11 07:32:11.783384"], ["updated_at", "2019-10-11 07:32:11.783384"]]
---
  def create
    @passenger = Passenger.new(passenger_params)

    respond_to do |format|
      if @passenger.save

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 98], ["LIMIT", 1]]
UPDATE "passengers" SET "name" = $1, "phone_num" = $2, "updated_at" = $3 WHERE "passengers"."id" = $4  [["name", "Lisa Simpson"], ["phone_num", "4255551111"], ["updated_at", "2019-10-11 07:32:11.825237"], ["id", 98]]
---
  def update
    @passenger = Passenger.find_by(id: params[:id])
    if @passenger.nil?
      head :not_found
      return
    end

    respond_to do |format|
      if @passenger.update(passenger_params)

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]
DELETE FROM "passengers" WHERE "passengers"."id" = $1  [["id", 81]]
---
  def destroy
    @passenger = Passenger.find_by(id: params[:id])
    if @passenger.nil?
      head :not_found
      return
    end
    @passenger.destroy