app/controllers/trips_controller.rb

  def index
    # Where did the request come from?  Per passenger? or per driver? or per trips index?
    @passenger = Passenger.find_by(id: params[:passenger_id])
    @driver = Driver.find_by(id: params[:driver_id])
    if @driver
      # showing trips for a specific driver
      @trips = Trip.where(driver_id: @driver.id)
    elsif @passenger
      # showing trips for a specific passenger
      @trips = Trip.where(passenger_id: @passenger.id)
      @can_rate = true
    else
      # just showing all Trips table for all passengers
      @trips = Trip.all
---
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "trips".* FROM "trips"

  def show
    trip_id = params[:id].to_i
    @trip = Trip.find_by(id: trip_id)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", -666], ["LIMIT", 1]]

  def create
    # find available driver
    @driver = Driver.find_by(active: false)
    if @driver.nil?
      redirect_to nope_path(params: {msg: "No drivers available, maybe you should walk"})
      return
    else
      puts "MAKING trip, FLIPPING driver.active from false to TRUE"
      # flip @driver.active to true.
      unless @driver.update(active: true)
        redirect_to nope_path(params: {msg: "Unexpected error, please call customer service at 1-800-LOL-SORRY"})
        return
      end


      # When do we flip it back to false? Normally we'd do that when GPS hits destination...
      # For this project, we'll flip it when passenger rates the trip.
    end

    # make new trip
    default_cost = 1000
    @trip = Trip.new(date: params[:date], rating: nil, cost: default_cost, driver_id: @driver.id, passenger_id: params[:passenger_id])
    if @trip.save

      # update passenger instance's total_spent
      @passenger = Passenger.find_by(id: params[:passenger_id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."active" = $1 LIMIT $2  [["active", false], ["LIMIT", 1]]
UPDATE "drivers" SET "updated_at" = $1, "total_earned" = $2 WHERE "drivers"."id" = $3  [["updated_at", "2019-10-11 07:55:35.659278"], ["total_earned", 668], ["id", 97]]
INSERT INTO "trips" ("date", "cost", "created_at", "updated_at", "driver_id", "passenger_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2019-10-11 07:32:11"], ["cost", 1000.0], ["created_at", "2019-10-11 07:32:11.152491"], ["updated_at", "2019-10-11 07:32:11.152491"], ["driver_id", 97], ["passenger_id", 82]]
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]

      else
        new_sum = @trip.cost
      end
      @passenger.update(total_spent: new_sum)
---
UPDATE "passengers" SET "total_spent" = $1, "updated_at" = $2 WHERE "passengers"."id" = $3  [["total_spent", 1000], ["updated_at", "2019-10-11 07:55:35.656126"], ["id", 178]]

  def edit
    # individual passenger uses this to update ratings
    @trip = Trip.find_by(id:params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", -666], ["LIMIT", 1]]

  def update
    # individual passenger uses this to update ratings
    @trip = Trip.find_by(id: params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", -666], ["LIMIT", 1]]

  def destroy######### FIX A BUG HERE!!! SEE TRELLO!!!!
    # Only passengers can delete their own trips via links
    selected_trip = Trip.find_by(id: params[:id])

    if selected_trip.nil?
      redirect_to nope_path(params: {msg: "No such trip exists!"})
      return
    else
      selected_trip.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", -666], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 10]]