app/controllers/trips_controller.rb

  def create
    passenger = Passenger.find_by(id: params[:passenger_id])
    trip_params = passenger.request_a_ride
    @trip = Trip.new(trip_params)

    if @trip.save
      driver = Driver.find_by(id: trip_params[:driver_id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 97], ["LIMIT", 1]]