app/models/driver.rb

  def total_earnings
    # pull all trips from driver
    driver_trips = self.trips
    # driver.trips
    # iterate and determine total for each trip grab the total cost and do math
    trips_total_cost = 0
    driver_trips.each do |trip|
---
SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1  [["driver_id", 1]]